# YOLOv8 Spectrometer (CoordAtt + P2 Head, ECA removed per ablation results)
nc: 3 
scales:
  n: [0.33, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 1, Conv, [128, 1, 1]]    # 1×1 卷积保持通道对齐（原 ECA 层已移除，消融实验显示 ECA 无正向贡献）
  - [-1, 3, C2f, [128, True]]    # 3
  - [-1, 1, Conv, [256, 3, 2]]   # 4-P3/8
  - [-1, 6, C2f, [256, True]]    # 5
  - [-1, 1, CoordAtt, [256, 256]] # 🌟 [位置2] 中层锁定垂直几何特征
  - [-1, 1, Conv, [512, 3, 2]]   # 7-P4/16
  - [-1, 6, C2f, [512, True]]    # 8
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 3, C2f, [1024, True]]   # 10
  - [-1, 1, SPPF, [1024, 5]]     # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]   # cat P4
  - [-1, 3, C2f, [512]]         # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]   # cat P3
  - [-1, 3, C2f, [256]]         # 17

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]   # 🌟 [关键] 接入 P2 层 (4倍下采样)，保留细线细节
  - [-1, 3, C2f, [128]]         # 20 (P2层小目标专用特征图)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]  # cat P3
  - [-1, 3, C2f, [256]]         # 23

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat P4
  - [-1, 3, C2f, [512]]         # 26

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat P5
  - [-1, 3, C2f, [1024]]        # 29

  - [[20, 23, 26, 29], 1, Detect, [nc]] # 🌟 4个检测头，包含 P2 细小目标头